# SQL

**Learning Objectives**: Learn how to connect to and query SQL databases and get the results back as Pandas DataFrames.

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

## Introduction

[SQL](http://en.wikipedia.org/wiki/SQL), or *Structured Query Lanauge* is a programming language focused on read, writing and transforming table based data sets, called *Relational Databases*. There are a number of reasons you might want to work with data in a SQL database:

* They offer high performance for a limited set of operations. They are much faster than Pandas for many types of operations, but are more limited.
* They can handle data sets that don't fit into memory. Pandas DataFrames have to fit in the memory of your computer, which limits their size. Data bases are typically stored on disk and don't have that limitation. This opens the door for working with much larger data sets. Most "big data" tools offer some sort of SQL interfaces.
* The data you want/need to work with may already be in a SQL database.


There are numerous free and open source databases that offer SQL interfaces:

* [SQLite](http://www.sqlite.org/)
* [MySQL](http://www.mysql.com/)
* [PostgreSQL](http://www.postgresql.org/)

It is a good idea to start with SQLite as it has good performance characteristics, doesn't require any specialized setup and comes already installed with Python.

There are a number of different Python packages for working with SQL databases:

* [SqlAlchemy](http://www.sqlalchemy.org/): foundation layer that other tools rely on.
* [pandas.io.sql](http://pandas.pydata.org/pandas-docs/stable/io.html#io-sql)
* [Blaze](http://blaze.pydata.org/docs/latest/index.html)

## Connecting

The first step in working with an existing SQL database is to connect to it. This involves figuring out the appropriate connection string and passing it to `sqlalchemy.create_engine`. Here is the logic for our SQLite database:

In [2]:
from sqlalchemy import create_engine

In [3]:
!rm titanic.db

rm: cannot remove ‘titanic.db’: No such file or directory

In [5]:
te = create_engine('sqlite:///titanic.db')
# te = create_engine('sqlite:////data/titanic.db')

Notice, this will use the file `titanic.db` in the current directory, which doesn't yet exist. SqlAlchemy will create it when needed. Here is the SqlAlchemy documentation for [engines and connection strings](http://docs.sqlalchemy.org/en/rel_0_9/core/engines.html).

## `pandas.io.sql`

Pandas has basic capabilties to reading, writing and querying SQL databases. These function are in the `pandas.io.sql` subpackage:

In [6]:
from pandas.io import sql

In [7]:
tdf = sns.load_dataset('titanic')

In [8]:
tdf.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

You can write a table to a SQL database using the `to_sql` method, which takes the name of the table and an engine object:

In [9]:
tdf.to_sql('people', te)

In [10]:
ls *.db

titanic.db

Now that we have a populated database table, we can use Pandas to query the data set. The first thing we might want to do is read the entire table back into Python as a `DataFrame`. To emphasize that this is a new object, let's delete the original `DataFrame` we had.

In [11]:
del tdf

Then use the `read_sql_table` function with the table name and engine object to get the entire table:

In [12]:
new_tdf = sql.read_sql_table('people', te)

In [13]:
new_tdf.head()

,index,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22,1,0,7.2500,S,Third,man,True,None,Southampton,no,False
1,1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26,0,0,7.9250,S,Third,woman,False,None,Southampton,yes,True
3,3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35,0,0,8.0500,S,Third,man,True,None,Southampton,no,True

Warning: don't do this unless you know exactly how large the table is. Databases can contain tables that are many times larger than the available memory on your system.

The real power of SQL databases comes from being able to query them using the SQL language. This can be done in Pandas using the `read_sql_query` function. To use this function, we need to cover the basic syntax of the SQL language. Here is a [high-level overview](http://www.w3schools.com/sql/default.asp) of the SQL language.

### SELECT

The `SELECT` statement is the most important part of the SQL language and is used to reads rows from a database table or tables. Here is an example that reads all (`*`) rows from the `people` table:

In [14]:
sql.read_sql_query('SELECT * FROM people;', te).head()
# select all (*) the columns from the people table

,index,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22,1,0,7.2500,S,Third,man,1,None,Southampton,no,0
1,1,1,1,female,38,1,0,71.2833,C,First,woman,0,C,Cherbourg,yes,0
2,2,1,3,female,26,0,0,7.9250,S,Third,woman,0,None,Southampton,yes,1
3,3,1,1,female,35,1,0,53.1000,S,First,woman,0,C,Southampton,yes,0
4,4,0,3,male,35,0,0,8.0500,S,Third,man,1,None,Southampton,no,1

You can read particular columns by name as follows:

In [16]:
sql.read_sql_query('SELECT survived, sex, age, fare FROM people;', te).head()
# .head() doesn't limit

   survived     sex  age     fare
0         0    male   22   7.2500
1         1  female   38  71.2833
2         1  female   26   7.9250
3         1  female   35  53.1000
4         0    male   35   8.0500

### LIMIT

You can use the `LIMIT` clause to limit the number of rows that are returned. This is much more efficient that reading all  rows and then using `.head()`.

In [18]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 LIMIT 10;
""", te)
#preffered formatting, not case sensitive though

   survived     sex  age     fare
0         0    male   22   7.2500
1         1  female   38  71.2833
2         1  female   26   7.9250
3         1  female   35  53.1000
4         0    male   35   8.0500
5         0    male  NaN   8.4583
6         0    male   54  51.8625
7         0    male    2  21.0750
8         1  female   27  11.1333
9         1  female   14  30.0708

### WHERE

You can use the `WHERE` clause to pick a subset of rows that satisfy certain criteria or tests. Notice how the notation for these tests is sligthly different from Python and Pandas.

In [20]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 WHERE age>20 AND survived=0 and sex="male";
""", te).head()
# notice boolean equals operator is a single '=', some may work with '=='

   survived   sex  age     fare
0         0  male   22   7.2500
1         0  male   35   8.0500
2         0  male   54  51.8625
3         0  male   39  31.2750
4         0  male   35  26.0000

### ORDER BY

You can sort the resulting rows using the `ORDER BY` clause and the name of a column or columns

In [21]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 WHERE age>20 AND survived=0 and sex="male"
 ORDER BY fare;
""", te).head()

   survived   sex  age  fare
0         0  male   36     0
1         0  male   40     0
2         0  male   49     0
3         0  male   39     0
4         0  male   38     0

Add `DESC` to reverse the order of the sort to descending:

In [22]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 WHERE age>20 AND survived=0 and sex="male"
 ORDER BY fare, age DESC;
""", te).head(10)

   survived   sex   age    fare
0         0  male  49.0  0.0000
1         0  male  40.0  0.0000
2         0  male  39.0  0.0000
3         0  male  38.0  0.0000
4         0  male  36.0  0.0000
5         0  male  33.0  5.0000
6         0  male  61.0  6.2375
7         0  male  34.5  6.4375
8         0  male  43.0  6.4500
9         0  male  34.0  6.4958

### SQL functions

SQL offers a host of functions that can applied to columns of data:

* `AVG()`
* `COUNT()`
* `MIN()`
* `MAX()`
* `SUM()`

Here we compute the number of males and the average fare they paid:

In [23]:
sql.read_sql_query("""
SELECT AVG(fare), COUNT(sex)
  FROM people
 WHERE sex="male";
""", te)

   AVG(fare)  COUNT(sex)
0  25.523893         577

In [24]:
filtered = new_tdf[new_tdf.sex=='male']
pd.DataFrame({'COUNT(sex)': [filtered.sex.count()], 'AVG(fare)': [filtered.fare.mean()]})

   AVG(fare)  COUNT(sex)
0  25.523893         577

### GROUP BY

The `GROUP BY` clause allows you to perform split-apply-combine to a table to perform a wide range of transformations and aggregations. This works almost identically to the `groupby` method in Pandas. Here we using `GROUP BY` to compute averarge fares by gender:

In [31]:
sql.read_sql_query("""
SELECT sex, AVG(fare)
  FROM people
 GROUP BY sex
""", te).set_index(['sex'])

        AVG(fare)
sex
female  44.479818
male    25.523893

Here is the same computation on a Pandas `DataFrame`:

In [32]:
new_tdf.groupby('sex')['fare'].mean()

sex
female    44.479818
male      25.523893
Name: fare, dtype: float64

## Database introspection

One of the most important things to do when you start exploring a new database is to survey what tables the database has and what columns those tables have. This is simple with `sqlalchemy.inspect` and Pandas.

For this part, we will use the [Chinook Database](https://chinookdatabase.codeplex.com/) of music:

In [33]:
ce = create_engine('sqlite:///data/Chinook_Sqlite.sqlite')

Create an inspector for that database:

In [34]:
from sqlalchemy import inspect
inspector = inspect(ce)

Get the column names from the database:

In [35]:
inspector.get_table_names()

['Album',
 'Artist',
 'Customer',
 'Employee',
 'Genre',
 'Invoice',
 'InvoiceLine',
 'MediaType',
 'Playlist',
 'PlaylistTrack',
 'Track']

Get the columns from a particular table:

In [36]:
inspector.get_columns('Artist')

[{'autoincrement': True,
  'default': None,
  'name': 'ArtistId',
  'nullable': False,
  'primary_key': 1,
  'type': INTEGER()},
 {'autoincrement': True,
  'default': None,
  'name': 'Name',
  'nullable': True,
  'primary_key': 0,
  'type': NVARCHAR(length=120)}]

Here is a simple function for retrieving the the columns names and types as a `DataFrame`:

In [37]:
def table_info(table_name, i):
    """Shwo the column names and types as a Pandas DataFrame."""
    return pd.DataFrame(i.get_columns(table_name))[['name','type']]

The `Album` table:

In [38]:
table_info('Album', inspector)

       name           type
0   AlbumId        INTEGER
1     Title  NVARCHAR(160)
2  ArtistId        INTEGER

The `Artist` table:

In [39]:
table_info('Artist', inspector)

       name           type
0  ArtistId        INTEGER
1      Name  NVARCHAR(120)

## Joining tables

Notice how both the `Artist` and `Album` table have an `ArtistId` column. Let's perform a join on those two tables. Similar to Pandas, SQL support 4 types of joins (INNER, LEFT, RIGHT, FULL). Notice how we are using AS to rename columns in the final result.

In [40]:
sql.read_sql_query("""
SELECT Album.Title AS AlbumTitle, Artist.Name AS Artist FROM Album
    INNER JOIN Artist
    ON Artist.ArtistId=Album.ArtistId
    ORDER BY Artist.Name;
""", ce)

,AlbumTitle,Artist
0,For Those About To Rock We Salute You,AC/DC
1,Let There Be Rock,AC/DC
2,"A Copland Celebration, Vol. I",Aaron Copland & London Symphony Orchestra
3,Worlds,Aaron Goldberg
4,The World of Classical Favourites,Academy of St. Martin in the Fields & Sir Nevi...
5,Sir Neville Marriner: A Celebration,Academy of St. Martin in the Fields Chamber En...
6,"Fauré: Requiem, Ravel: Pavane & Others","Academy of St. Martin in the Fields, John Birc..."
7,Bach: Orchestral Suites Nos. 1 - 4,"Academy of St. Martin in the Fields, Sir Nevil..."
8,Balls to the Wall,Accept
9,Restless and Wild,Accept
10,Górecki: Symphony No. 3,Adrian Leaper & Doreen de Feis
11,Big Ones,Aerosmith
12,Quiet Songs,Aisha Duo
13,Jagged Little Pill,Alanis Morissette
14,Adorate Deum: Gregorian Chant from the Proper ...,Alberto Turco & Nova Schola Gregoriana
15,Facelift,Alice In Chains
16,Back to Black,Amy Winehouse
17,Frank,Amy Winehouse
18,Vivaldi: The Four Seasons,"Anne-Sophie Mutter, Herbert Von Karajan & Wien..."
19,"Tchaikovsky: 1812 Festival Overture, Op.49, Ca...",Antal Doráti & London Symphony Orchestra
20,Warner 25 Anos,Antônio Carlos Jobim
21,Chill: Brazil (Disc 2),Antônio Carlos Jobim
22,Plays Metallica By Four Cellos,Apocalyptica
23,Aquaman,Aquaman
24,Audioslave,Audioslave
25,Out Of Exile,Audioslave
26,Revelations,Audioslave
27,BackBeat Soundtrack,BackBeat
28,The Last Night of the Proms,Barry Wordsworth & BBC Concert Orchestra
29,Battlestar Galactica: The Story So Far,Battlestar Galactica
...,...,...
317,Serie Sem Limite (Disc 2),Tim Maia
318,Acústico,Titãs
319,Volume Dois,Titãs
320,Bach: Toccata & Fugue in D Minor,Ton Koopman
321,Vinícius De Moraes - Sem Limite,Toquinho & Vinícius
322,Achtung Baby,U2
323,All That You Can't Leave Behind,U2
324,B-Sides 1980-1990,U2
325,How To Dismantle An Atomic Bomb,U2
326,Pop,U2
327,Rattle And Hum,U2
328,The Best Of 1980-1990,U2
329,War,U2
330,Zooropa,U2
331,Instant Karma: The Amnesty International Campa...,U2
332,UB40 The Best Of - Volume Two [UK],UB40
333,Diver Down,Van Halen
334,"The Best Of Van Halen, Vol. I",Van Halen
335,Van Halen,Van Halen
336,Van Halen III,Van Halen
337,Axé Bahia 2001,Various Artists
338,Carnaval 2001,Various Artists
339,Sambas De Enredo 2001,Various Artists
340,Vozes do MPB,Various Artists
341,Contraband,Velvet Revolver
342,Vinicius De Moraes,Vinícius De Moraes
343,Bach: Goldberg Variations,Wilhelm Kempff
344,Bartok: Violin & Viola Concertos,Yehudi Menuhin
345,Bach: The Cello Suites,Yo-Yo Ma
346,Ao Vivo [IMPORT],Zeca Pagodinho